/**
 난이도: Level 1
 
 [문제 설명]
 두 수를 입력받아 두 수의 최대공약수와 최소공배수를 반환하는 함수, solution을 완성해 보세요. 배열의 맨 앞에 최대공약수, 그다음 최소공배수를 넣어 반환하면 됩니다. 예를 들어 두 수 3, 12의 최대공약수는 3, 최소공배수는 12이므로 solution(3, 12)는 [3, 12]를 반환해야 합니다.

 [제한 사항]
 두 수는 1이상 1000000이하의 자연수입니다.
 
 [입출력 예]
 n    m       return
 3    12     [3, 12]
 2    5       [1, 10]
 
 [입출력 예 설명]
 입출력 예 #1
 위의 설명과 같습니다.

 입출력 예 #2
 자연수 2와 5의 최대공약수는 1, 최소공배수는 10이므로 [1, 10]을 리턴해야 합니다.
 */

func solution(_ n:Int, _ m:Int) -> [Int] {
    return [gcd(n, m), lcm(n, m)]
}

/**
 유클리드 호제법을 이용한 재귀함수 !!
 
 [예시]
 1071과 1029의 최대공약수를 구하면,

 1071은 1029로 나누어떨어지지 않기 때문에, 1071을 1029로 나눈 나머지를 구한다. ≫ 42
 1029는 42로 나누어떨어지지 않기 때문에, 1029를 42로 나눈 나머지를 구한다. ≫ 21
 42는 21로 나누어떨어진다.
 따라서, 최대공약수는 21이다.
 */
func gcd(_ a: Int, _ b: Int) -> Int {
    return b != 0 ? gcd(b, a % b) : a
}

/**
 최소공배수 공식(최대공약수를 이용)
 a,b: 최소공배수를 구하고자 하는 두 수
 gcd(a,b): a와b의 최대공약수
 (최소공배수 * 최대공약수 = a * b)를 이용
 */
func lcm(_ a: Int, _ b: Int) -> Int {
   return a * b / gcd(a, b)
}

// 최소공배수를 구하기 위해선 최대공약수를 먼저 구해야 한다.

print(solution(3, 12))
print(solution(2, 5))
