/**
 난이도: Level 1
 
 [문제 설명]
 1937년 Collatz란 사람에 의해 제기된 이 추측은, 주어진 수가 1이 될때까지 다음 작업을 반복하면, 모든 수를 1로 만들 수 있다는 추측입니다. 작업은 다음과 같습니다.

 1-1. 입력된 수가 짝수라면 2로 나눕니다.
 1-2. 입력된 수가 홀수라면 3을 곱하고 1을 더합니다.
 2. 결과로 나온 수에 같은 작업을 1이 될 때까지 반복합니다.
 예를 들어, 입력된 수가 6이라면 6→3→10→5→16→8→4→2→1 이 되어 총 8번 만에 1이 됩니다. 위 작업을 몇 번이나 반복해야하는지 반환하는 함수, solution을 완성해 주세요. 단, 작업을 500번을 반복해도 1이 되지 않는다면 –1을 반환해 주세요.

 [제한 사항]
 입력된 수, num은 1 이상 8000000 미만인 정수입니다.
 
 [입출력 예]
 [n]            [result]
  6                8
  16              4
  626331     -1
 */

func solution(_ num:Int) -> Int {
    var count = 0 // 1이 될 때 까지 반복된 수
    var n = num // 1이 되고자 하는 숫자
    
    while count < 500 { // 500번 반복
        if n == 1 { break } // n이 1이면 반복문 종료
        count += 1 // n이 1이 아닌경우 count 1 증가
        
        // n을 2로 나눈 나머지가 0인 경우는 짝수이고, 0이 아니면 홀수이다.
        n = (n % 2) == 0 ? (n / 2) : (n * 3) + 1 // 삼항연산자
    }
    
    return n == 1 ? count : -1
}

print(solution(6))
print(solution(16))
print(solution(626331))
