//
//  main.swift
//  Dynamic Programming
//
//  Created by 최지수 on 2021/09/16.
//

import Foundation


// MARK: - 1로 만들기
// _1로만들기()

// MARK: - 설탕 배달
// 설탕배달()

// MARK: - 1, 2, 3 더하기
// _123더하기()

// MARK: - 피보나치 함수 [1003번]
// 피보나치함수()

// MARK: - 피보나치 수 5 [10870번]
// 피보나치수5()

// MARK: - 2×n 타일링 [11726번]
// _2xn타일링()

// MARK: - RGB거리 [1149번]
// RGB거리()

// MARK: - RGB거리 2 [17404번]
//RGB거리2()

// MARK: - 계단 오르기 [2579번]
//계단오르기()

// MARK: - 가장 긴 증가하는 부분 수열 [11053번]
//가장_긴_증가하는_부분_수열()

// MARK: - 피보나치 수 2 [2748번]
//피보나치수2()

// MARK: - 포도주 시식 [2156번]
//포도주시식()

// MARK: - 카드 구매하기 [11052번]
//카드구매하기()

// MARK: - 동전 1 [2293번]
//동전1()

// MARK: - 동전 2 [2294번]
//동전2()

// MARK: - 돌 게임 2 [9656번]
//돌게임2()

// MARK: - 연속합 [1912번]
//연속합()

// MARK: - 정수 삼각형 [1932번]
//정수삼각형()

// MARK: - 가장 긴 감소하는 부분 수열 [11722번]
//가장_긴_감소하는_부분_수열()

// MARK: - 이동하기 [11048번]
//이동하기()

// MARK: - 합분해 [2225번]
//합분해()

// MARK: - 이친수 [2193번]
//이친수()

// MARK: - 퇴사 [14501번]
//퇴사()

// MARK: - 쉬운 계단 수 [10844번]
//쉬운계단수()

// MARK: - 1, 2, 3 더하기 5 [15990번]
_123더하기5()
