//
//  main.swift
//  Dynamic Programming
//
//  Created by 최지수 on 2021/09/16.
//

import Foundation


// MARK: - 1로 만들기
// _1로만들기()

// MARK: - 설탕 배달
// 설탕배달()

// MARK: - 1, 2, 3 더하기
// _123더하기()

// MARK: - 피보나치 함수 [1003번]
// 피보나치함수()

// MARK: - 피보나치 수 5 [10870번]
// 피보나치수5()

// MARK: - 2×n 타일링 [11726번]
// _2xn타일링()

// MARK: - RGB거리 [1149번]
// RGB거리()

// MARK: - RGB거리 2 [17404번]
//RGB거리2()

// MARK: - 계단 오르기 [2579번]
//계단오르기()

// MARK: - 가장 긴 증가하는 부분 수열 [11053번]
//가장_긴_증가하는_부분_수열()

// MARK: - 피보나치 수 2 [2748번]
//피보나치수2()

// MARK: - 포도주 시식 [2156번]
포도주시식()
